//require('dotenv').config();
import express from 'express';

const app = express();

/*app.get('/', (req, res) => {
    res.send('');
});*/

app.get('/api/bangla', (req, res) => {
    const banglaJokes = [
        {
            id: 1,
            joke: 'শিক্ষক: পড়াশোনা করছো না কেন? ছাত্র: স্যার, কারণ বিদ্যুৎ চলে গেলে মোমবাতি জ্বলে, আর আমার জ্বালায় পড়া থেমে যায়।',
        },
        {
            id: 2,
            joke: "বউ: তুমি আমাকে কখনো কফি বানিয়ে দাও না! স্বামী: তোমার জন্য আমি একেবারে 'কফি উইথ করণ' বানিয়ে দেব।",
        },
        {
            id: 3,
            joke: 'ডাক্তার: তোমার মাথাব্যথার কারণ কী? রোগী: স্যার, আমি কখনো মনে রাখতে পারি না। ডাক্তার: সেটাই মাথাব্যথার কারণ।',
        },
        {
            id: 4,
            joke: 'বন্ধু ১: তুই কেন সিঙ্গেল? বন্ধু ২: কারণ আমি সিঙ্গেল বলেই এই সুন্দর জোকস শুনতে পারি।',
        },
        {
            id: 5,
            joke: 'শিক্ষক: পরীক্ষার খাতা খারাপ দেখে কী শিখলে? ছাত্র: খাতা ভালো বানাতে হলে পরীক্ষার আগে আঁকার প্র্যাকটিস করতে হবে!',
        },
    ];
    res.send(banglaJokes);
});
const port = process.env.PORT || 3000;
app.listen(port, () => {
    console.log(`Example app listening on port ${port}!`);
});
